#include<stdio.h>
int main(){

	/*字符数组：用char型数组表示一串字符
	 初始化方法:
	 1.普通数组:char str[6] = {'h','e','l','l','o','\0'}
	 2.特殊初始化:char str[6] = "hello"
    */


	/*char str[6] = { 'h', 'e', 'l', 'l', 'o', '\0' };
	'\0':整数零代表了字符串的结束，字符长度为n，以n+1为字符串长度
	*/

	
	/*输出字符串
	char str[] = "hello";
	printf("%s \n", str);
	*/

	
	/*加入特殊字符(转移符)
	char str[] = "my name : \"shaofa\" ";
	printf("%s \n", str);
	*/


	//字符串的结束符（打印一串字符时遇到‘\0’结束）,结果hello
	char str[12] = "hello";
	printf("%s \n",str);

	//第三个元素强制设为零只打印前两个字符he（遇到零就停止打印）
	str[2] = 0;
	printf("%s \n", str);


	//注意
	//1.如果字符串后面没有‘\n'没有以零结束printf会一直尝试打印下去
	//2.字符串长度为结束符之前部分的长度，没有0结果会出现乱码
	//3.数组初始化时足够大，要比数组长度大1
	//4.不以零为结束的字符串不是正常字符串
	//5.0之后的字符不会被打印
























































		























	return 0;
}