#include <iostream>

int main()
{
    /*
     一  
       二进制／十进制／十六进制
     （一）十进制（D：decimal）
         数学里：123=1*100+2*10+3*1
         C语言里：int a = 123;
      (二)十六进制（X／hex/hexadecimal）
         数学里：123=1*16*16+2*16+3*1
         C语言里：int a = 0x123;
      (三)二进制（bin/binary）
         数学里：0，1 例如：00001101=8+4+1
         C语言里：11111111=255（d）
     二
       内存的表示
       （一）物理内存的单元时“字节”，一个字节8个位
       （二）表示范围：
            一个字节表示范围：0000 0000～1111 1111
            两个字节表示范围：0000 0000 0000 0000～1111 1111 1111 1111
            4个字节表示范围：0x00000000~0xFFFFFFFF
     
     
     
     
     
     
     
     
     
     
     
     */
    return 0;
}
