/*
 特殊函数

（一）不带参数的函数：
      参数可以0个也可以很多个

（二）return的用法：
    1.返回一个值
    2.函数退出后面语句不被执行
    3.return语句可以放在函数体的任意位置
    4.可以在复合语句中，都可以直接退出函数并返回值
（三）结论：
    1.只要得到结果立即用return语句返回即可
      不必把return语句放在函数体的最后一行
    2.return语句执行后函数退出
    3.如果中间没有return语句被执行，
      则函数体内的语句会按照逻辑一直执行到最后一行

（四）没有返回值的函数
    1.定义：
	  当一个函数不需要返回值时，把返回值类型设置为viod
	  如：viod welcome（）
	2.用法：
	  2.1他没有使用return语句，程序执行到函数体最后一行
	  2.2当函数返回值为viod时，也可以使用return来退出函数
	  2.3返回值为viod时，return语句不能带一个数值
	  2.4当函数的返回值为viod时，函数调用式子不是右值
 */














