#include<stdio.h>
int main()
{
	//数组定义
	//char arr[5];数组名字就是地址不用加&符号
	//getchar();
	//char arr[5] = { 90, 91, 92, 93, 94 };//也可以只定义数组中部分元素
	//return 0;//地址是16进制，调试-窗口-内存


	//数组的使用
	//char arr[5] = { 90, 91, 92, 93, 94 };
	//printf(" %d \n",rr[0]);//访问数组元素下标从零开始
	//return 0;

	//改变数组中的值，访问
	//char arr[5] = { 90, 91, 92, 93, 94 }; 
	//arr[1] = 99;//写操作，F9 break point 调试F5可以看变量的值可以加断点 运行CTRL+F5就直接运行看不到的
	//printf("%d\n", arr[1]);//读操作

	//数组读写
	//int n = 10;
	//arr[1] = arr[0] - n;//读写,F10单步运行
	//printf("%d\n", arr[1]);//读shift+F5 调试停止，调试时不能运行，运行时不能调试，断点一点就消失

	/*改变数组顺序，调换a1 a2
	char arr[5] = { 90, 91, 92, 93, 94 };//F7编译生成程序 
	char s = arr[1];//s:91
	arr[1] = arr[2];//a1:92
	arr[2] = s;//a2:91,F5-局部变量-看变量过程
	*/

	//数组元素指定
	//int arr[8] = { 1, 2, 3, 4, 5, 6, 7, 8 };//4*8个字节，元素个数需要指定
	//return 0; //不加断点无法找到目标内存






	


	return 0;











}